app/controllers/listings_controller.rb

INSERT INTO "listings" ("user_id", "title", "property_type", "guests", "bedrooms", "bathrooms", "price_per_night", "address_line1", "city", "state", "postcode", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create

    listing = Listing.new(listing_params)
    listing.user = current_user

    if listing.save