app/controllers/reservations_controller.rb

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
  def index

    @reservations = Reservation.find_by(user_id: current_user.id)