app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "email", "encrypted_password", "remember_token", "full_name", "address_line1", "city", "state", "postcode", "country", "phone_number") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
	def create

		user = User.new(user_params)

		if user.save